       01  FILEA.
           03  STAT           PIC X.
           03  NUMB           PIC X(6).
           03  NAME           PIC X(20).
           03  ADDRX          PIC X(20).
           03  PHONE          PIC X(8).
           03  DATEX          PIC X(8).
           03  AMOUNT         PIC X(8).
           03  COMMENT        PIC X(9).