//TECCFDRE JOB FPVI606B,TECJVB,MSGCLASS=Q,CLASS=M,REGION=0M,
//    MSGLEVEL=(1,1),NOTIFY=TECCFD
//*
//IEB1 EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=X
//SYSOUT   DD SYSOUT=X
//I1       DD DISP=SHR,DSN=TEC.TECCFD.QRTCB.SRC
//O1       DD DISP=SHR,DSN=TEC.TECCFD.QRTCB.SRC2
//O2       DD DISP=SHR,DSN=TEC.TECCFD.PEPE
//SYSIN    DD *
 COPYMOD INDD=I1,OUTDD=O1
