          MACRO                                                         00001001
          INIT                                                          00002001
*                                                                       00003005
R0        EQU   0                                                       00010000
R1        EQU   1                                                       00011000
R2        EQU   2                                                       00012000
R3        EQU   3                                                       00013000
R4        EQU   4                                                       00014000
R5        EQU   5                                                       00015000
R6        EQU   6                                                       00016000
R7        EQU   7                                                       00017000
R8        EQU   8                                                       00018000
R9        EQU   9                                                       00019000
R10       EQU   10                                                      00019100
R11       EQU   11                                                      00019200
R12       EQU   12                                                      00019300
R13       EQU   13                                                      00019400
R14       EQU   14                                                      00019500
R15       EQU   15                                                      00019600
          USING *,R12                                                   00019704
          STM   R14,R12,12(R13)                                         00019804
          LR    R12,R15                                                 00019904
          ST    R13,SAVER13                                             00020004
          LR    R15,R13                                                 00030004
          LA    R13,SAVEAREA                                            00040004
          ST    R13,8(R15)                                              00050004
          MEND                                                          00060001