      *Programa Ejemplo
      *Cobol////////////////////////////////////////
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
           DISPLAY 'Hola  ejemplo'.
           STOP RUN.
      */////////////////////////////////////////////
