      *Programa Ejemplo
      *Cobol////////////////////////////////////////
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJEMPLO2.
       PROCEDURE DIVISION.
           DISPLAY 'Hola Manola '.
           STOP RUN.
      */////////////////////////////////////////////
