      *Programa Ejemplo
      *Cobol////////////////////////////////////////
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
           DISPLAY 'Hola  world Prisma bitbucket'.
           STOP RUN.
      */////////////////////////////////////////////
      */////////////////////////////////////////////